#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
//int main()
//{
//	//6 = 0110  7 = 0111  & 与，要都是1 才可以输出1，如果有一个为0那就是0 
//	printf("%d\n",6&7);
//	return 0;
//}
//&&&&&&&&&&&&&&&&&&&&&&要两个都是1才为1，只要有一个是0就为0
//||||||||||||||||||||||||只要有一个是1就为1，都为0时才为0   &与|刚好相反
//^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^对位结果不同的时候结果位为1，相同的时候为0（shift+6）
//~~~~~~~~~~~~~~~~~~~~~~~~~（shift+数字1左边按键）~~~~按位取反，对二进制的每一位取反
//正整数的原码反码补码都相同
//负整数的三种码表示方法各不相同
//原码，将原数字按二进制取数就为原码，原码有32位，左边第一位为符号位，符号位为0表示正，为1表示负
//想得到反码，原码的符号位不变，其他31位依次取反就可以得到反码
//补码：反码加1就可以得到补码，例如7的二进制原码为000………………0111，+1后就为000…………1000，为十进制的数字8
//即原码得补码操作为   符号位不变，取反，+1，即得到补码，
//补码得到原码的操作为  取反，+1（符号位也依旧不变）
//数据存放内存中其实用的都是补码
//左移操作符  <<   将左边抛弃右边直接补0
//右移操作符 >>  分逻辑右移和算术右移（基本上都是算术右移）
//逻辑右移就是把数字整体往右移，右边多的抛弃，左边少的直接用0补（不恰当，不考虑符号位的正负）
//算术右移就是看这个数原本是正负的，0为正1为负，补回对应0/1
//左右移不要用>>-1,这个不会表示向左移动1位，因为移动负数位并没有被定义
//int main()
//{
//	int num1 = -3;//-3 = 1000………………000011    反码 1111………………111100 补码 1111…………111101
//	int num2 = 5;// 5 =  0000………………000101   这是正数，反码补码原码一样   5 =  0000…………000101      以下三个都是负数要用补码变成原码       
//	printf("%d\n", num1 & num2);//0000………………00001  1                          0000…………000101                          十进制的数为：   5
//	printf("%d\n", num1 |num2);//1000…………000111   -7                            1111…………111101        0000…………000011                 -3
//	printf("%d\n", ~ num2);//1111…………111010      ?                              1111…………111010        0000…………000110                 -6
//	printf("%d\n", num1 ^  num2);//1000…………000110  -6                           1111…………111000        0000…………001000                 -8
	//补码取反+1变为原码的时候，符号位不变，剩余31位取反
	//但是如果是^（shift+6）符号取反，整体（符号位和剩下31位数字都取反）
	//数字之间进行&~^|符号操作的时候，流程为： 先把数字转为原码，然后一律变为反码（此处变反码符号位不变），然后反码+1得到补码，接着补码进行符号对应的运算，得到对应补码，然后看补码的符号位第一个是
	//0还是1，若是0，则为正数，为1则为负数  如果是0的话就代表是正数，正数的原码反码补码都相同，所以这个时候第一位是0的补码即为原码，可以直接转为正数  如果第一位是1就是负数  ，负数的补码转为原码要
	//取反+1，此处第一位数字（即符号位不变），其他31位都变，得到反码，然后+1得到原码，原码十进制化得到想要的数字
	//操作符^~&|对符号位也作用


//}
//int main()
//{
//	int a = 10; //000…………01010
//	int b = 20;//0000…………10100
//	a = a ^ b;//000000……… 11110  2+4+8+16 = 30
//	b = a ^ b;//000000000000001010
//	a = a ^ b;//             10100
//	printf("%d %d", a, b);
//}
//这是利用异或运算（^）的特性来实现不借助临时变量交换两个整数的值，其核心原理基于异或的以下性质：
//1. 异或的基本性质
//性质 1：a ^ a = 0（一个数和自身异或，结果为 0）。
//性质 2：a ^ 0 = a（一个数和 0 异或，结果为自身）。
//性质 3：异或运算满足交换律和结合律，即 a ^ b = b ^ a，(a ^ b) ^ c = a ^ (b ^ c)。
//int main()
//{
//	int num = 7; //0000000111>>00001110  2+4+8=14
//	num = num << 1;
//	printf("%d", num);
////}
//int main()
//{
//	int num = 10;
//	int count = 0;
//	while (num)
//	{
//		if (num % 2 == 1)
//			count++;
//		num = num / 2;
//	}
//	printf("二进制中1的个数=%d\n", count);
//	return 0;
//}
//int main()
//{
//	int num = 666;
//	int i = 0;
//	int count = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if (num & (1 << i))///00000000000000000000000000001  1
//			count++;       ///11111111111111111111111111111  num   -1  明白了
//	}
//	printf("二进制中1的个数 = %d\n", count);
//	return 0;
//}
// 
// 
// //这里是因为1的二进制代码是0000…………0001，i是把000…………001向左移i位的意思 
//int main()
//{
//	int num = -1;
//	int i = 0;
//	int count = 0;
//	while (num)
//	{
//		count++;
//		num = num & (num - 1);
//
//	}
//	printf("二进制中1的个数 = %d\n", count);//111111111111111111111111111111  num
//	return 0;                               //111111111111111111111111111110  num-1
//}                                           //111111111111111111111111111110  num
                                            //111111111111111111111111111101 num - 1
                                            //111111111111111111111111111100 num
//int main()
//{
//	int a = 13;
//	a = a | (1 << 4);//00000000000000010000 
//	                 // 13:0000000000001101
//	                 //     000000000011101   1+4+8+16 =29
//	printf("%d", a);
//	a = a & ~(1 << 4);  //~取反操作符把00000000000000000010000变成了1111111111111111111101111
//	printf("%d", a);//                                                        000000000011101
//	return 0;//                                                                  000000001101
//}
//逗号表达式
//int main()
//{
//	int a = 1;
//	int b = 2;
//	int c = (a > b, a = b + 10, b = a + 1);//此处a.>b并不成立，但是也不影响后面的表达式继续执行
//	printf("%d", c);
//	return 0;
//}
//int main()
//{
//	int a = 1;
//	int b = 2;
//	int c = (a > b, a = b + 10, b = a + 1);//整个表达式结果是最后一个式子的结果
//	/*if(a = b+1,c=a/2,d>0)*/   
//	a = get_val();
//	count_val(a);
//	while (a > 0)
//	{
//		a = get_val();
//		count_val(a);
//	}
//	while (a = get_val, count_val(a), a > 0)
//	{
//
//	}
//}
//int main()
//{
//	int arr[10] = { 0 };
//	arr[9] = 10;
//}
//void test1 ()
//{
//	printf("hehe\n");
//}
//void test2(const char *str)
//{
//	printf("%s\n", str);
//}
//int main()
//{
//	test1();
//	test2("hello bit.");
//	return 0;
//}
//struct tag
//{
//	char name[20];
//	int age;
//	char sex[10];
//	char id[20];
//};
//struct point
//{
//	int x;
//	int y;
//}p1;
//struct point p2;
//struct point p3 = { 10 ,20 };
//struct stu
//{
//	char name[15];
//	int age;
//};
//struct stu s1 = { "zhangsan",20 };
//struct stu s2 = { .age = 20, .name = "lisi" };
//struct node
//{
//	int data;
//	struct point p;
//	struct node* next;
//}n1 = { 10,{4,5},NULL };
//struct node n2 = { 20,{5,6},NULL };
//struct point
//{
//	int x;
//	int y;
//}p = {1,2};
//int main()
//{
//	printf("x = %d, y = %d",p.x,p.y);
//	return 0;
//}
//struct point
//{
//	int x;
//	int y;
//};
//int main()
//{
//	struct point p = { 3,4 };
//	struct point* ptr = &p;
//}
char c1 = -1;
